[
    {
        "date" : "MAR 21",
        "headLine":"Free agricultural insurance for red onion cultivation",
        "content": "The Ministry of Agriculture decided yesterday (12) to provide free insurance for red onion cultivation in Sri Lanka.\n\nCurrently, the Agricultural and Agrarian Insurance Board has provided free agricultural insurance coverage for 06 types of crops. Accordingly, free insurance has been provided for paddy, chillies, big onions, potatoes, maize, and soya. This insurance covers crop damage caused by wild elephants, crop damage due to drought and heavy rain.\n\nIn the year 2024, a program to expand red onion cultivation in Sri Lanka has been started again. Accordingly, the Minister of Agriculture and Plantation Industries, Mr. Mahinda Amaraweera yesterday (12) told the Agriculture and Agrarian Insurance Board to include red onion cultivation among the crop insurance crops to provide free compensation to those farmers in case of crop damage due to the above-mentioned facts.\n\nThe Agricultural and Agrarian Insurance Board has taken steps to provide compensation of Rs. 40,000 per acre and Rs. 100,000 for 01 hectare. Accordingly, the Minister was advised to take steps to provide such amount to the farmers in case of damage to the red onion crop.\n\nYesterday (12) afternoon, the Minister revealed these facts in a discussion held with the officials of the Agriculture and Agricultural Insurance Board at the Ministry of Agriculture. A group of officials related to the Department of Agrarian Development and the Ministry of Agriculture participated in this event.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2305-13-02-2024-1e"
        },{
        "date": "MAR 22",
        "headLine": "The Department of Agriculture offers minimum purchasing prices for paddy to the paddy purchasing program of government in Maha season.",
        "content": "The government has prepared a program for purchasing paddy from farmers in the 2023/24 Maha season as per a Cabinet decision.\n\nAccordingly, after providing loans to the three sectors of small and medium-scale paddy mill owners, persons engaged in paddy storage activities, and paddy collectors through State and private banks on a subsidized loan basis, it was decided to purchase paddy through them. In the implementation of the paddy purchase program by these people, the sectors mentioned above will purchase paddy under the minimum purchasing prices for paddy presented by the Department of Agriculture.\n\nAccordingly, the Department of Agriculture has presented the minimum purchasing prices for paddy for this paddy procurement program which is being implemented under the full supervision of the Ministry of Finance.\n\nThe prices are as follows:\n\nFor paddy with a moisture level of 14 percent:\nPrice per 1 kg of Nadu paddy: Rs. 105\nSamba: Rs. 120\nKeeri Samba: Rs. 130\nFor paddy above 14 percent moisture:\nPrice per 1 kg of Nadu paddy: Rs. 90\nSamba: Rs. 100\nKeeri Samba: Rs. 120\nThe government is set to provide a maximum loan amount of 50 million rupees for small and medium-scale rice mill owners and a maximum loan amount of 25 million rupees for paddy storers and paddy collectors through state and private banks to purchase this paddy.\n\nThis loan scheme is to be implemented throughout the island and only the paddy harvests of 2023/24 Maha season can be purchased under this.\n\nAccordingly, the purchase of paddy should be done at the prices offered by the Department of Agriculture. Also, the supervision of this paddy purchase is carried out jointly by the Department of Agrarian Development with the District Secretariat and the Divisional Secretariat.\n\nThe Department of Agriculture took suggestions from all sectors including farmers' organizations in determining the maximum prices. Accordingly, steps were taken by the Department of Agriculture to present these prices. It has been possible to offer the highest price for the 2023/24 Maha season paddy harvest according to these prices.\n\nMeanwhile, Mr. Janaka Dharmakeerthi, Secretary of Ministry of Agriculture, says that the Paddy Marketing Board has also used a special arrangement to purchase paddy this year as per the instructions of Mr. Mahinda Amaraweera, Minister of Agriculture and Plantation Industries. Paddy Marketing Board purchases paddy especially for consumer protection in cases of rising rice prices as well as in cases of falling rice prices, with the aim of maintaining a stable price for paddy of the farmers. A Cabinet paper is to be submitted for obtaining the Cabinet approval for this. He also said that the Paddy Marketing Board has planned to obtain an amount of two billion rupees for the purchase of paddy.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2300-09-02-2024-1e"
    }, {
        "date": "MAR 23",
        "headLine": "A donation from Qatar Charity Institution to provide fertilizer to 3000 farmers who cultivate other crops except paddy in three districts at the rate of Rs. 20,000 per farmer.",
        "content": "Qatar Charity Institution has taken steps to provide financial donations for provide fertilizer required by 3000 farmers who grow vegetables and other crops except paddy in three districts during Maha season. Under that, arrangements have been made to provide fertilizer worth Rs. 20,000 to one farmer.\n        A discussion regarding this matter was held yesterday evening (10) under the chairmanship of Mr. Mahinda Amaraweera Hon. Minister of Agriculture and Mr. Mahmoud Abu Khalifa, Country Director of Qatar Charity also participated in the event. Mr. Gunadasa Samarasinghe, Secretary of the Ministry of Agriculture and other officials also participated in this discussion.\n        Although the necessary financial and material concessions were given to the farmers who cultivate paddy in several cropping seasons, it was not possible to arrange a considerable level of concessions for the farmers who cultivate vegetables and other crops. Therefore, 3000 farmers who grow vegetables and other crops in three districts will be selected and given a stock of fertilizer worth Rs. 20,000 each, based on the assistance provided by Qatar Charity Institution under this program.\n        This scheme is implemented for farmers who cultivate vegetables and other crops in Kurunegala, Monaragala and Matale districts with less than one hectare of land. Qatar Charity Institution has taken steps to select especially low-income farmers for this purpose.\n        Mr. Mahinda Amaraweera Hon. Minister of Agriculture who expressed his views in here emphasized that the farmers who grow maize and chilies as well as vegetables will get some relief through this donation, and the government has given a lot of concessions to the farmers for paddy cultivation in the past. As a result, rice production in the country increased. Although some parties have presented facts that the price of a kilo of rice will increase up to Rs. 500, The Minister has stated that the price of rice fell from Rs. 280 to Rs. 130.\n        The Minister has mentioned that the vegetable crops in the country have been greatly affected due to the recent drought and the current rains, so there is a possibility of a severe shortage of vegetables in the coming period as well as an increase in the price of vegetables and also mentioned that appreciates the offer of Qatar Charity Institution to provide relief for vegetable farmers.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2261-11-10-2023-1e"
        },{
        "date": "MAR 24",
        "headLine": "It is decided to make B-60 policy for Quality Assurance of Tea Leaves mandatory from 01 January 2024.",
        "content": "Mr. Mahinda Amaraweera, Minister of Agriculture and Plantation Industries has instructed all the sectors related to the tea industry today (06) to take steps to make the B-60 policy which is implemented to ensure the quality of tea produced in Sri Lanka, compulsory from January 01.\n\nThe B-60 policy means that at least 60 percent of the leaves used to produce tea must be of high quality.\n\nThis morning, the Minister has discussed the next steps to be taken to ensure the quality of Sri Lankan tea with the representatives of all the sectors belonging to the tea industry. In this discussion, he discussed with all sectors including Tea Development Authority, Tea Small Holdings Development Authority, Tea Research Institute, Tea Suppliers Association and Tea Manufacturers Association.\n\nThe Sri Lanka tea brand was a brand that took the world by storm a few decades ago, and due to the activities of some businessmen, the brand of Sri Lanka tea faced a serious crisis.\n\nTherefore, project B-60 was initiated to ensure the high quality of tea leaves to restore the high recognition of Sri Lankan tea in the international market.\n\nMr. Mahinda Amaraweera, Minister of Agriculture and Plantation Industries has mentioned that as this project has not yet been implemented, in order to establish the market for the tea industry in Sri Lanka in the future, this project should be implemented immediately.\n\nAccordingly, all parties involved in the tea industry have agreed today (06) to make the B-60 project compulsory from January 01 to ensure the quality of tea leaves supplied to tea factories.\n\nCommenting on this, the Minister has said that in order to rebuild the tea industry in this country, the quality of tea must be improved. The Minister also mentioned that this B-60 project is being implemented by preventing the mixing of matured tea leaves in addition to tea leaves.\n\nThe Minister has also instructed the Ceylon Tea Board to take steps to revoke the license of any factory that violates this decision.\n\nThe Secretary of the Ministry, Janaka Dharmakeerthi, Tea Small Holdings Development Authority, Ceylon Tea Board and Tea Development Authority officials also participated in this discussion.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2283-06-12-2023-1e"
        },{
        "date" :"MAR 26",
        "headLine" : "The Minister of Agriculture emphasizes that there is a Risk of Food Shortage in the Country due to sudden Weather Changes.",
        "content": "Mr. Mahinda Amaraweera Hon. Minister of Agriculture has stated that due to the impact of sudden weather changes in the country at present, there is a risk that our country will have to face a food shortage.\n\nThe Minister made this warning in a discussion regarding the implementation of projects to increase the production of food crops at the Ministry of Agriculture this morning (04).\n\nAbout 70,000 acres of paddy cultivation have been destroyed due to the severe drought in the past few days and hundreds of acres of paddy cultivation which were about to be harvested have also been destroyed due to the torrential rains that are currently falling in several provinces.\n\nThe vegetable cultivations in the low country have also been destroyed by the rain. Around 15,000 acres of green gram crops that were cultivated in Hambantota district have also been completely destroyed. About 40 percent of the country's total green gram requirement could be obtained through this cultivation.\n\nEmphasizing the possibility of a food shortage due to this, the Minister advised Mr. Gunadasa Samarasinghe the Secretary of Agriculture to immediately implement a program for growing vegetables in the gardens as much as possible and a food crop cultivation plan for this Maha season.\n\nAlso, the Minister has informed that a report regarding food crop damage due to weather changes should be provided immediately by the Department of Agriculture. The Minister informed that the food crop cultivation plan prepared accordingly should be jointly implemented by the Department of Agriculture and the Department of Agrarian Development and steps should be taken to get many other institutions to participate in this.\n\nThe Minister also mentioned in this discussion that due to the Meteorological divisions predicting that the current rainy weather condition and drought conditions may occur again in the next Yala season, close attention should be paid regarding this.\n\nOfficials from several institutions including the Department of Livestock, Agriculture participated in this discussion.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2255-04-10-2023-1e"
        },{
        "date" : "MAR 21",
        "headLine": "The amount of Crop damage due to drought, rain and Sena Caterpillar damage is close to 70,000 acres.",
        "content": "The amount of crop damage occurred in this Yala season has increased up to 68,802.20 acres as of 2023.09.21. Also, the number of farmers affected due to this has increased up to 70,597.\n\nAccording to the new report issued by the Agricultural and Agrarian Insurance Board, 68,340.35 acres of cultivated paddy fields have been damaged and 70,188 farmers have been affected by that. Also, 409 farmers who cultivated big onions, chilies, maize, and soybeans have been affected, 461.85 acres cultivated by them have been damaged.\n\nThe highest amount of crop damage reported so far has been reported from Kurunegala district. Accordingly, crop damages occurred in that district are 26,813.67 acres. The number of farmers affected is 32,245.\n\nThe second-highest amount of damage is reported from Udawalawe region. Accordingly, 14,810.13 acres have been damaged, and the number of farmers affected is 11,651. In addition to that, 5,483.75 acres have been damaged in Hambanthota district, and 4,493 farmers have been affected.\n\nFurthermore, 1,496 acres in Matale, 2,244 acres in Puttalam, 1,728 acres in Polonnaruwa, 1,136 acres in Monaragala, 1,044 acres in Badulla, 1,721 acres in Rathnapura, and 1,748 acres in Anuradhapura have been recorded.\n\nMr. Mahinda Amaraweera Hon. Minister of Agriculture has stated that the assessment of crop damage carried out by the Agricultural and Agrarian Insurance Board was advised to be completed promptly. Also, the minister said that the said report will be submitted to the Cabinet of Ministers and after that the decision of the Cabinet of Ministers regarding crop damage will be announced.\n\nHowever, the Minister has mentioned that the government will have to pay the highest crop damage compensation in the history of Sri Lanka this time.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2252-22-09-2023-1e"
    },
     {
        "date" :"MAR 28",
        "headLine" : "The Acreage of Crop Damage is increased up to 59,073.98 acres as of 30th August.",
        "content": "The Ministry of Agriculture has focused on how the cultivation activities should be carried out in the coming Maha season considering the drought situation that has affected the country due to the El Nino process in the Pacific Ocean.\nMr. Mahinda Amaraweera Hon. Minister of Agriculture has instructed the Department of Agriculture and Department of Agrarian Development today (31) to inform the farmers to start the basic activities such as cleaning the canals & dams, clearing the paths of paddy fields for the commencement of farming activities before the onset of the northeast monsoon rains in approaching Maha season as well as to start the initial ground preparation activities using the convective rains that fall before the monsoon.\nAccording to the expert opinions, there is a higher possibility of receiving heavy rainfall in this Maha season, especially in October and November. However, the Minister also advised to take this step to manage as much water as possible as there may be a dry weather condition again from January next year.\nAmount of Crop Damage as of 2023.08.30\nMeanwhile, it has been reported by yesterday that the amount of paddy field acres of additional crops that has been damaged is increased up to 59,073.98. Number of farmers affected is 54,152.\nAs of yesterday, the highest amount of crop damage is reported in Kurunegala district. The number of acres is 26,195.90. Number of farmers is 31,427.\nThe second most damage is reported from Udawalawe region. Accordingly, number of acres is 14,667.50 and the number of farmers is 5,867.\nMeanwhile, the Ministry of Agriculture does not have the ability to provide compensation or financial allocation for plantation crops (such as cinnamon, rubber, tea, pepper and coconut) under the scope of the Ministry of Agriculture for the current crop damages. Another Ministry has the said responsibility.\nCrop damage compensation can be provided only for six (06) types of crops under the Agricultural and Agrarian Insurance Board which is under the Ministry of Agriculture. The said 6 types of crops are paddy, maize, chilies, potatoes, big onions and soy beans. A sum of Rs. 100,000 per hectare at a rate of Rs. 40,000 per acre is being provided as compensation for these 6 crops in a case of crop damage under the normal insurance scheme.\nThis amount is a free compensation given by the government without any premium.\nIn addition to this, Agricultural and Agrarian Insurance Board has started an arrangement which will able the farmers to get a compensation of Rs. 2.5 lakhs per hectare at the rate of Rs.1 lakh per acre in a case of crop damage by paying a premium of Rs. 6400 for these crops per season.\nMr. Mahinda Amaraweera Hon. Minister of Agriculture has mentioned that since the damage occurred to the paddy cultivation in this Yala season is exceptional, a higher compensation than this will be paid.\nThe Minister has also stated that the entire report will be submitted to the Cabinet of Ministers as soon as the current crop damage assessments are completed and compensation for the crop damage will be provided before the start of the Maha season.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2233-01-09-2023-1ee"
        },{
        "date" :"MAR 29",
        "headLine" : "8. Amount of crop damage reported as at 29.08.2023 - The amount of paddy fields damaged due to the prevailing drought condition has increased up to 58,766 acres.",
        "content": "The Agricultural and Agrarian Insurance Board has handed over the crop damage report on paddy and other crops reported as at 2023.08.29 due to the prevailing dry weather condition to Mr. Mahinda Amaraweera Hon. Minister of Agriculture.\n\nAccordingly, by the 29th, the total amount of damaged paddy fields is 58,766.97 acres. The cultivated area of paddy is 58,389.82 acres and other crops are 377.15 acres out of this.\n\nThe number of affected farmers has increased up to 53,965. So far, the highest amount of crop damage is reported from Kurunegala district. Accordingly, it is 26,195.11 acres. The number of farmers affected is 31,427.\n\nThe second-highest crop damage is reported from Udawalawe region still, which is 16,667.50 acres. The number of affected farmers is 5,867. Also, the amount of damaged paddy acres in Matale district is 1,496.35 and the number of farmers affected is 2,255. The amount of damaged paddy acres in Puttalam district is 1,765.56 and the number of farmers affected is 1,185. The number of farmers affected from crop damage in Polonnaruwa district is 470, and the amount of damaged paddy acres is 1,149.75. The number of farmers affected from crop damage in Rathnapura district is 1,971, and the amount of damaged paddy acres is 1293.50.\n\nMeanwhile, the discussion on how to do the cultivation in consideration of the prevailing weather conditions in the coming Maha season was held at the Hector Kobbekaduwa Agricultural Research and Training Institute. In the discussion chaired by the Minister of Agriculture, the Minister has mentioned that actions will be taken to compensate the farmers who had suffered from crop damage before the beginning of the Maha season. The Minister has also mentioned that the compensation will be expedited.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2221-29-08-2023-3e"
        },{
        "date": "MAR 21",
        "headLine": "Challenges faced by farmers cultivating 44/1 paddy variety discussed at parliamentary committee",
        "content": "Even though the 44/1 paddy variety, cultivated by farmers in the Eastern province including Ampara and Batticaloa, has yielded higher results, members of parliament highlighted the problematic situation faced by farmers unable to sell the said paddy at the Advisory Committee on Agriculture held at the parliamentary premises today.\n\nThe advisory committee relevant to the Ministry of Agriculture convened at committee hall no. 1 in the morning with the participation of Mr. Mahinda Amaraweera Hon. Minister of Agriculture. Members of parliament in attendance raised concerns about the issue faced by farmers in the Eastern province.\n\nThe Minister commented that neither the Paddy Marketing Board nor the private sector would purchase this paddy variety. He mentioned that both sectors had rejected purchasing the paddy because the seeds split into three parts during harvesting. However, the Minister stated that the Department of Agriculture should provide an explanation as to why farmers were prompted to cultivate such a type of paddy.\n\nFurthermore, the Minister mentioned that if this paddy variety would be cultivated in the next seasons or if another paddy variety would be introduced, the policy of the Department of Agriculture regarding the matter should be clarified.\n\nMeanwhile, the Minister stated that the yield generated by this paddy variety is expected to be used for animal feed or purchased by the Paddy Marketing Board.\n\nOfficers from several institutions under the Ministry of Agriculture, including the Ministry of Agriculture, Department of Agriculture, and Department of Agrarian Development, participated in this advisory committee meeting.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2199-09-08-2023-1e"
    }
    ,{
        "date": "MAR 30",
        "headLine": "Government allocates Rs. 11 billion for fertilizer subsidies to paddy farmers in Yala Season",
        "content": "The government has allocated Rs. 11 billion to provide financial subsidies to 550,000 farmers who cultivate paddy in the Yala Season to buy fertilizer.\n\nMr. Mahinda Amaraweera, the Minister of Agriculture, stated that the government has focused on providing a financial subsidy for the purchase of fertilizer for farmers who are cultivating paddy during this Yala Season.\n\nIn particular, this subsidy is due to be provided with the aim of reducing the cost of production for the farmers. Minister Amaraweera mentioned that President Ranil Wickremesinghe, as the Minister of Finance, has decided to provide Rs. 20,000 for one hectare of paddy cultivation and Rs. 40,000 for two hectares.\n\nThe government has to spend a sum of Rs. 11 billion for this subsidy. About 550,000 farmers who cultivate paddy in the Yala season are entitled to this subsidy.\n\nThe TSP fertilizer required for the Yala season has already been provided to the farmers free of charge. The Ministry of Agriculture has focused on reducing the price of a bundle of urea fertilizer by up to 10,000 rupees and reducing the price of a bundle of MOP fertilizer by 4,500 rupees from the current market price.\n\nA Cabinet paper was also presented by Mr. Mahinda Amaraweera, the Minister of Agriculture, as per the instructions of President Ranil Wickremesinghe, regarding providing financial subsidy to the farmers who cultivate paddy in this Yala season. Accordingly, farmers can use this financial provision to buy the fertilizers they need.\n\nMr. Gunadasa Samarasinghe, the Secretary of the Ministry, mentioned that the Ministry of Agriculture expects that the money will be used for the purchase of fertilizer by the farmers as it has been proposed to credit the money directly to the bank accounts of the farmers.",
        "link" : "https://www.agrimin.gov.lk/web/index.php/en/news-scroll/2079-24-04-2023-1e"
    }
    
]